{
  [257] = {
    map = "ポケモンセンター"
  },
  [258] = {
    map = "アサギジム"
  },
  [259] = {
    map = "ポケモン交換の家"
  },
  [260] = {
    map = "アサギ House Beta"
  },
  [261] = {
    signpost_1 = "本棚",
    map = "渦巻島の話をする民家",
    signpost_2 = "テレビ"
  },
  [262] = {
    map = "釣りおやじの家"
  },
  [263] = {
    map = "アサギ食堂"
  },
  [264] = {
    map = "フレンドリーショップ"
  },
  [265] = {
    map = "38番道路 エンジュ Gate"
  },
  [266] = {
    object_3 = "ミルタンク",
    map = "小屋"
  },
  [267] = {
    map = "ミルク屋"
  },
  [268] = {
    signpost_1 = "立札",
    map = "38番道路",
    signpost_2 = "立札"
  },
  [269] = {
    signpost_3 = "立札",
    signpost_4 = "隠しアイテムｗ",
    object_4 = "ミルタンク",
    object_5 = "ミルタンク",
    object_6 = "ミルタンク",
    signpost_1 = "立札",
    map = "39番道路",
    object_7 = "ミルタンク",
    signpost_2 = "立札"
  },
  [270] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_5 = "立札",
    signpost_6 = "張り紙",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "アサギシティ",
    signpost_2 = "立札"
  },
  [513] = {
    map = "赤いギャラドスの話の効ける家"
  },
  [514] = {
    map = "チョージジム"
  },
  [515] = {
    map = "ポケモンセンター"
  },
  [516] = {
    map = "42番道路 エンジュ Gate"
  },
  [517] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_5 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "42番道路",
    signpost_2 = "立札"
  },
  [518] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "44番道路",
    signpost_2 = "立札"
  },
  [519] = {
    signpost_3 = "立札",
    signpost_4 = "張り紙",
    signpost_1 = "立札",
    map = "チョージタウン",
    signpost_2 = "張り紙"
  },
  [769] = {
    signpost_1 = "ポケモン像",
    map = "マダツボミの塔 1階",
    signpost_2 = "ポケモン像"
  },
  [770] = {
    map = "マダツボミの塔 2階"
  },
  [771] = {
    signpost_3 = "マダツボミの絵",
    signpost_4 = "マダツボミの絵",
    signpost_5 = "ポケモン像",
    signpost_6 = "ポケモン像",
    signpost_1 = "ポケモン像",
    map = "マダツボミの塔 3階",
    signpost_2 = "ポケモン像"
  },
  [772] = {
    map = "鈴の塔 1階"
  },
  [773] = {
    map = "鈴の塔 2階"
  },
  [774] = {
    map = "鈴の塔 3階"
  },
  [775] = {
    warp_3 = "鈴の塔 5階",
    warp_4 = "鈴の塔 5階",
    signpost_1 = "隠しアイテムｗ",
    map = "鈴の塔 4階",
    warp_1 = "鈴の塔 5階"
  },
  [776] = {
    signpost_1 = "隠しアイテムｗ",
    map = "鈴の塔 5階",
    signpost_2 = "隠しアイテムｗ"
  },
  [777] = {
    map = "鈴の塔 6階"
  },
  [778] = {
    map = "鈴の塔 7階"
  },
  [779] = {
    map = "鈴の塔 8階"
  },
  [780] = {
    map = "鈴の塔 9階"
  },
  [781] = {
    signpost_1 = "隠しアイテムｗ",
    map = "焼けた塔 1階",
    signpost_2 = "隠しアイテムｗ"
  },
  [782] = {
    map = "焼けた塔 地下1階"
  },
  [783] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_4 = "立札",
    signpost_1 = "立札",
    map = "自然公園",
    object_7 = "ペルシアン",
    signpost_2 = "張り紙"
  },
  [784] = {
    map = "自然公園 虫取り大会"
  },
  [785] = {
    signpost_1 = "掲示板",
    map = "ラジオ塔 1階",
    signpost_2 = "パンフレット"
  },
  [786] = {
    signpost_3 = "本棚",
    signpost_4 = "本棚",
    signpost_5 = "本棚",
    object_9 = "プリン",
    signpost_6 = "ポスター",
    signpost_1 = "張り紙",
    map = "ラジオ塔 2階",
    signpost_2 = "ポスター"
  },
  [787] = {
    map = "ラジオ塔 3階"
  },
  [788] = {
    map = "ラジオ塔 4階"
  },
  [789] = {
    map = "ラジオ塔 5階"
  },
  [790] = {
    map = "アルフの遺跡 外角"
  },
  [791] = {
    map = "アルフの遺跡 Ho-oh Chamber"
  },
  [792] = {
    map = "アルフの遺跡 Kabuto Chamber"
  },
  [793] = {
    map = "アルフの遺跡 Omanyte Chamber"
  },
  [794] = {
    map = "アルフの遺跡 Aerodactyl Chamber"
  },
  [795] = {
    map = "アルフの遺跡 Inner Chamber"
  },
  [796] = {
    map = "アルフの遺跡 研究所"
  },
  [797] = {
    map = "アルフの遺跡 Ho-oh Item Room"
  },
  [798] = {
    map = "アルフの遺跡 Kabuto Item Room"
  },
  [799] = {
    map = "アルフの遺跡 Omanyte Item Room"
  },
  [800] = {
    map = "アルフの遺跡 Aerodactyl Item Room"
  },
  [801] = {
    map = "アルフの遺跡 Ho-Oh Word Room"
  },
  [802] = {
    map = "アルフの遺跡 Kabuto Word Room"
  },
  [803] = {
    map = "アルフの遺跡 Omanyte Word Room"
  },
  [804] = {
    map = "アルフの遺跡 Aerodactyl Word Room"
  },
  [805] = {
    map = "繋がりの洞窟 1階"
  },
  [806] = {
    map = "繋がりの洞窟 地下1階"
  },
  [807] = {
    map = "繋がりの洞窟 地下2階"
  },
  [808] = {
    map = "ヤドンの井戸 地下1階"
  },
  [809] = {
    map = "ヤドンの井戸 地下2階"
  },
  [810] = {
    warp_4 = "落下地点",
    warp_5 = "落下地点",
    map = "アサギの灯台 1階"
  },
  [811] = {
    warp_3 = "穴",
    warp_4 = "穴",
    warp_5 = "落下地点",
    map = "アサギの灯台 2階",
    warp_6 = "落下地点"
  },
  [812] = {
    warp_7 = "落下地点",
    warp_8 = "落下地点",
    warp_4 = "穴",
    warp_9 = "落下地点",
    warp_5 = "穴",
    map = "アサギの灯台 3階",
    warp_6 = "落下地点"
  },
  [813] = {
    warp_7 = "穴",
    warp_8 = "穴",
    warp_4 = "穴",
    warp_9 = "落下地点",
    warp_10 = "落下地点",
    warp_5 = "穴",
    map = "アサギの灯台 4階",
    warp_6 = "穴",
    warp_1 = "穴"
  },
  [814] = {
    warp_7 = "落下地点",
    warp_4 = "穴(帰り道)",
    warp_5 = "穴(帰り道)",
    signpost_1 = "隠しアイテムｗ",
    map = "アサギの灯台 5階",
    warp_6 = "落下地点"
  },
  [815] = {
    warp_3 = "穴(帰り道)",
    object_2 = "アカリちゃん",
    map = "アサギの灯台 6階",
    warp_2 = "穴(帰り道)"
  },
  [816] = {
    map = "フレンドリーショップ 1階"
  },
  [817] = {
    signpost_3 = "ペルシアン像",
    warp_3 = "ワープパネル",
    signpost_8 = "本棚",
    signpost_9 = "隠しアイテムｗ",
    signpost_7 = "本棚",
    map = "ロケット団アジト 地下1階",
    signpost_2 = "ペルシアン像"
  },
  [818] = {
    map = "ロケット団アジト 地下2階"
  },
  [819] = {
    map = "ロケット団アジト 地下3階"
  },
  [820] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_4 = "隠しアイテムｗ",
    signpost_5 = "祠",
    signpost_1 = "立札",
    map = "ウバメの森",
    signpost_2 = "隠しアイテムｗ"
  },
  [821] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_4 = "隠しアイテムｗ",
    signpost_5 = "隠しアイテムｗ",
    signpost_1 = "鍵付き扉",
    map = "地下倉庫 エントランス",
    signpost_2 = "張り紙"
  },
  [822] = {
    signpost_3 = "スイッチ3",
    signpost_4 = "非常用スイッチ",
    signpost_5 = "隠しアイテムｗ",
    signpost_6 = "隠しアイテムｗ",
    signpost_1 = "スイッチ1",
    map = "地下通路 エントランス",
    signpost_2 = "スイッチ2"
  },
  [823] = {
    object_8 = "ゴーリキー",
    map = "コガネ百貨店 地下1階"
  },
  [824] = {
    map = "地下倉庫"
  },
  [825] = {
    map = "すり鉢山 1階 外角"
  },
  [826] = {
    map = "すり鉢山 1階 内角"
  },
  [827] = {
    map = "すり鉢山 2階 内角"
  },
  [828] = {
    map = "すり鉢山 地下1階"
  },
  [829] = {
    map = "氷の抜け道 1階"
  },
  [830] = {
    map = "氷の抜け道 地下1階"
  },
  [831] = {
    signpost_1 = "隠しアイテムｗ",
    map = "氷の抜け道 地下2階 チョージ側"
  },
  [832] = {
    map = "氷の抜け道 地下2階 フスベ側"
  },
  [833] = {
    map = "氷の抜け道 地下3階"
  },
  [834] = {
    map = "渦巻島 北西"
  },
  [835] = {
    map = "渦巻島 北東"
  },
  [836] = {
    warp_3 = "渦巻島 地下1階",
    map = "渦巻島 南西"
  },
  [837] = {
    map = "渦巻島の洞窟"
  },
  [838] = {
    map = "渦巻島 南東"
  },
  [839] = {
    warp_3 = "渦巻島 北東",
    warp_8 = "渦巻島 地下2階[",
    warp_4 = "渦巻島 南西",
    warp_5 = "渦巻島 南西",
    map = "渦巻島 地下1階",
    signpost_2 = "隠しアイテムｗ"
  },
  [840] = {
    map = "渦巻島 地下2階"
  },
  [841] = {
    object_1 = "ルギア",
    map = "渦巻島 ルギアの間"
  },
  [842] = {
    map = "しろがね山 Room 1"
  },
  [843] = {
    map = "しろがね山 Room 2"
  },
  [844] = {
    map = "しろがね山 Room 3"
  },
  [845] = {
    map = "しろがね山 Item Rooms"
  },
  [846] = {
    map = "暗闇の洞窟 キキョウ側入り口"
  },
  [847] = {
    map = "暗闇の洞窟 フスベ側入り口"
  },
  [848] = {
    map = "竜の穴 1階"
  },
  [849] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_4 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "竜の穴 地下1階",
    signpost_2 = "隠しアイテムｗ"
  },
  [850] = {
    map = "竜の祠"
  },
  [851] = {
    map = "登場の滝"
  },
  [852] = {
    map = "ディグダの穴"
  },
  [853] = {
    map = "お月見山"
  },
  [854] = {
    map = "地下"
  },
  [855] = {
    signpost_1 = "隠しアイテムｗ",
    map = "岩山トンネル 1階",
    signpost_2 = "隠しアイテムｗ"
  },
  [856] = {
    signpost_1 = "隠しアイテムｗ",
    map = "岩山トンネル 地下1階"
  },
  [857] = {
    map = "サファリゾーン セキチク Gate"
  },
  [858] = {
    map = "サファリゾーン"
  },
  [859] = {
    warp_7 = "チャンピオンロード アイテムルーム",
    warp_9 = "落下地点",
    signpost_1 = "隠しアイテムｗ",
    map = "チャンピオンロード",
    signpost_2 = "隠しアイテムｗ"
  },
  [1025] = {
    map = "家"
  },
  [1026] = {
    map = "鈴の塔 守護３兄弟の家"
  },
  [1027] = {
    map = "ポケモンセンター"
  },
  [1028] = {
    map = "ルギアの話の聞ける民家"
  },
  [1029] = {
    signpost_1 = "衝立",
    map = "劇場",
    object_7 = "サイドン",
    signpost_2 = "衝立"
  },
  [1030] = {
    map = "フレンドリーショップ"
  },
  [1031] = {
    warp_23 = "ワープ床",
    warp_12 = "ワープ床",
    warp_7 = "ワープ床",
    warp_29 = "ワープ床",
    warp_18 = "ワープ床",
    warp_3 = "ワープ地点",
    warp_24 = "ワープ床",
    warp_13 = "ワープ床",
    warp_8 = "ワープ床",
    warp_30 = "ワープ床",
    warp_19 = "ワープ床",
    warp_4 = "ワープ床",
    warp_25 = "ワープ床",
    warp_14 = "ワープ床",
    warp_9 = "ワープ床",
    warp_31 = "ワープ床",
    warp_20 = "ワープ床",
    warp_26 = "ワープ床",
    warp_15 = "ワープ床",
    warp_10 = "ワープ床",
    warp_32 = "ワープ床",
    warp_21 = "ワープ床",
    warp_5 = "ワープ床",
    warp_27 = "ワープ床",
    warp_16 = "ワープ床",
    signpost_1 = "掲示板",
    map = "エンジュジム",
    warp_33 = "ワープ床",
    warp_22 = "ワープ床",
    warp_11 = "ワープ床",
    warp_6 = "ワープ床",
    warp_28 = "ワープ床",
    warp_17 = "ワープ床",
    signpost_2 = "掲示板"
  },
  [1032] = {
    map = "ダウジングマシンの家"
  },
  [1033] = {
    signpost_3 = "立札",
    warp_3 = "鈴の塔 ゲート",
    signpost_8 = "隠しアイテムｗ",
    signpost_4 = "張り紙",
    signpost_5 = "立札",
    signpost_6 = "張り紙",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "エンジュシティ",
    signpost_2 = "立札"
  },
  [1281] = {
    map = "フスベジム 1階"
  },
  [1282] = {
    map = "フスベジム 2階"
  },
  [1283] = {
    map = "竜の話の聞ける家"
  },
  [1284] = {
    map = "ポケモン交換の家"
  },
  [1285] = {
    map = "フレンドリーショップ"
  },
  [1286] = {
    map = "ポケモンセンター"
  },
  [1287] = {
    map = "忘れオヤジの家"
  },
  [1288] = {
    signpost_1 = "立札",
    map = "45番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [1289] = {
    signpost_1 = "立札",
    map = "46番道路"
  },
  [1290] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_5 = "立札",
    signpost_6 = "張り紙",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "フスベシティ",
    signpost_2 = "立札"
  },
  [1537] = {
    map = "ポケモンセンター"
  },
  [1538] = {
    map = "ポケモンセンター 2階"
  },
  [1539] = {
    map = "19番道路 - セキチク Gate"
  },
  [1540] = {
    map = "ふたご島ジム"
  },
  [1541] = {
    signpost_1 = "立札",
    map = "19番道路",
    signpost_2 = "立札"
  },
  [1542] = {
    signpost_1 = "立札",
    map = "20番道路"
  },
  [1543] = {
    map = "21番道路"
  },
  [1544] = {
    signpost_3 = "立札",
    signpost_4 = "隠しアイテムｗ",
    signpost_1 = "張り紙",
    map = "グレン島",
    signpost_2 = "立札"
  },
  [1793] = {
    map = "ジムバッチの話の聞ける家"
  },
  [1794] = {
    map = "ハナダ警察署"
  },
  [1795] = {
    map = "交換の話をする家"
  },
  [1796] = {
    map = "ポケモンセンター"
  },
  [1797] = {
    map = "ポケモンセンター 2階"
  },
  [1798] = {
    signpost_3 = "掲示板",
    signpost_1 = "隠しアイテムｗ",
    map = "ハナダジム",
    signpost_2 = "掲示板"
  },
  [1799] = {
    map = "フレンドリーショップ"
  },
  [1800] = {
    map = "ポケモンセンター"
  },
  [1801] = {
    map = "ポケモンセンター 2階"
  },
  [1802] = {
    signpost_1 = "本棚",
    map = "発電所",
    signpost_2 = "本棚"
  },
  [1803] = {
    map = "まさきの家"
  },
  [1804] = {
    signpost_1 = "立札",
    map = "4番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [1805] = {
    signpost_1 = "立札",
    map = "7番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [1806] = {
    signpost_1 = "立札",
    map = "10番道路 North",
    signpost_2 = "張り紙"
  },
  [1807] = {
    map = "24番道路"
  },
  [1808] = {
    signpost_1 = "張り紙",
    map = "25番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [1809] = {
    signpost_3 = "張り紙",
    signpost_8 = "張り紙",
    signpost_4 = "張り紙",
    signpost_9 = "隠しアイテムｗ",
    signpost_5 = "立札",
    signpost_6 = "鍵のかかった家",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "ハナダシティ",
    signpost_2 = "立札"
  },
  [2049] = {
    map = "ポケモンセンター"
  },
  [2050] = {
    signpost_3 = "ラジオ",
    object_3 = "カモネギ",
    signpost_1 = "本棚",
    map = "墨職人の小屋",
    signpost_2 = "本棚"
  },
  [2051] = {
    map = "フレンドリーショップ"
  },
  [2052] = {
    signpost_3 = "写真",
    signpost_4 = "本棚",
    signpost_5 = "本棚",
    signpost_6 = "ポケモン像",
    signpost_7 = "窓",
    signpost_1 = "写真",
    map = "ガンテツの家",
    signpost_2 = "写真"
  },
  [2053] = {
    map = "ヒワダジム"
  },
  [2054] = {
    signpost_1 = "立札",
    map = "33番道路"
  },
  [2055] = {
    signpost_3 = "立札",
    signpost_8 = "立札",
    signpost_4 = "掲示板",
    signpost_9 = "井戸",
    signpost_5 = "立札",
    signpost_6 = "張り紙",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "ヒワダタウン",
    signpost_2 = "立札"
  },
  [2305] = {
    map = "怒りの湖 目覚めるパワーの家"
  },
  [2306] = {
    map = "怒りの湖 コイキングの話をする家"
  },
  [2307] = {
    map = "43番道路 チョージ Gate"
  },
  [2308] = {
    map = "43番道路 Gate"
  },
  [2309] = {
    signpost_3 = "立札",
    signpost_1 = "立札",
    map = "43番道路",
    signpost_2 = "立札"
  },
  [2310] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_4 = "隠しアイテムｗ",
    signpost_5 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "怒りの湖",
    signpost_2 = "立札"
  },
  [2561] = {
    signpost_3 = "立札",
    signpost_4 = "張り紙",
    signpost_5 = "隠しアイテムｗ",
    signpost_6 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "32番道路",
    signpost_2 = "立札"
  },
  [2562] = {
    signpost_1 = "立札",
    map = "35番道路",
    signpost_2 = "立札"
  },
  [2563] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_1 = "掲示板",
    map = "36番道路",
    signpost_2 = "立札"
  },
  [2564] = {
    object_1 = "双子ちゃん",
    signpost_1 = "立札",
    object_2 = "双子ちゃん",
    map = "37番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [2565] = {
    signpost_3 = "立札",
    signpost_4 = "張り紙",
    signpost_5 = "張り紙",
    signpost_6 = "張り紙",
    signpost_7 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "キキョウシティ",
    signpost_2 = "張り紙"
  },
  [2566] = {
    map = "フレンドリーショップ"
  },
  [2567] = {
    map = "キキョウジム"
  },
  [2568] = {
    signpost_3 = "黒板",
    signpost_4 = "黒板",
    signpost_1 = "本棚",
    map = "ジョバンニ先生のポケモン塾",
    signpost_2 = "本田棚"
  },
  [2569] = {
    map = "ニックネームの話の聞ける家"
  },
  [2570] = {
    map = "ポケモンセンター"
  },
  [2571] = {
    map = "ポケモン交換の家"
  },
  [2572] = {
    map = "32番道路 アルフの遺跡 Gate"
  },
  [2573] = {
    map = "ポケモンセンター"
  },
  [2574] = {
    map = "35番道路 コガネ gate"
  },
  [2575] = {
    map = "35番道路 自然公園 gate"
  },
  [2576] = {
    map = "36番道路 アルフの遺跡 gate"
  },
  [2577] = {
    signpost_1 = "張り紙",
    map = "36番道路 自然公園 gate"
  },
  [2817] = {
    signpost_3 = "立札",
    signpost_4 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "34番道路",
    signpost_2 = "立札"
  },
  [2818] = {
    signpost_10 = "立札",
    signpost_3 = "立札",
    signpost_8 = "立札",
    signpost_11 = "立札",
    signpost_4 = "立札",
    signpost_9 = "立札",
    signpost_12 = "立札",
    signpost_5 = "立札",
    signpost_6 = "立札",
    signpost_7 = "立札",
    signpost_1 = "立札",
    map = "コガネシティ",
    signpost_2 = "立札"
  },
  [2819] = {
    map = "コガネジム"
  },
  [2820] = {
    map = "自転車屋 ミラクルサイクル"
  },
  [2821] = {
    map = "夏輝度判断師の家"
  },
  [2822] = {
    map = "まさきの家"
  },
  [2823] = {
    map = "コガネ駅"
  },
  [2824] = {
    map = "フラワーショップ"
  },
  [2825] = {
    map = "PPの説明をしてくれる民家"
  },
  [2826] = {
    map = "姓名判断氏の家"
  },
  [2827] = {
    signpost_1 = "案内板",
    map = "コガネ百貨店 1階",
    signpost_2 = "エレベーターの押しボタン(意味無し)"
  },
  [2828] = {
    map = "2階 トレーナーズマーケット"
  },
  [2829] = {
    map = "3階 バトルコレクション"
  },
  [2830] = {
    map = "4階 メディシンボックス"
  },
  [2831] = {
    map = "5階 わざマシンコーナー"
  },
  [2832] = {
    signpost_3 = "自動販売機",
    signpost_4 = "自動販売機",
    signpost_5 = "自動販売機",
    signpost_6 = "自動販売機",
    signpost_1 = "掲示板",
    map = "6階 憩いの広場",
    signpost_2 = "エレベーター押しボタン(意味無し)"
  },
  [2833] = {
    signpost_1 = "操作板",
    map = "エレベーター"
  },
  [2834] = {
    signpost_4 = "ポケモンガチャガチャ",
    signpost_1 = "望遠鏡",
    map = "屋上 展望台",
    signpost_2 = "望遠鏡"
  },
  [2835] = {
    signpost_21 = "カードめくり",
    signpost_10 = "スロットマシン",
    signpost_3 = "スロットマシン",
    signpost_27 = "カードめくり",
    signpost_16 = "スロットマシン",
    signpost_8 = "スロットマシン",
    signpost_22 = "カードめくり",
    signpost_11 = "スロットマシン",
    signpost_4 = "スロットマシン",
    signpost_28 = "カードめくり",
    signpost_17 = "スロットマシン",
    signpost_9 = "スロットマシン",
    signpost_23 = "カードめくり",
    signpost_12 = "スロットマシン",
    signpost_5 = "スロットマシン",
    signpost_29 = "カードめくり",
    signpost_18 = "スロットマシン",
    signpost_24 = "カードめくり",
    signpost_13 = "スロットマシン",
    signpost_6 = "スロットマシン",
    signpost_30 = "カードめくり",
    signpost_19 = "カードめくり",
    signpost_25 = "カードめくり",
    signpost_14 = "スロットマシン",
    signpost_7 = "スロットマシン",
    signpost_1 = "スロットマシン",
    map = "ゲームコーナー",
    signpost_31 = "飲みかけのコップ",
    signpost_20 = "カードめくり",
    signpost_26 = "カードめくり",
    signpost_15 = "スロットマシン",
    signpost_2 = "スロットマシン"
  },
  [2836] = {
    map = "ポケモンセンター"
  },
  [2837] = {
    map = "ポケモンセンター 2階"
  },
  [2838] = {
    map = "ウバメの森 ヒワダ Gate"
  },
  [2839] = {
    object_2 = "バタフリー",
    map = "34番道路 ウバメの森 Gate"
  },
  [2840] = {
    map = "育て屋さん"
  },
  [3073] = {
    signpost_1 = "立札",
    map = "6番道路"
  },
  [3074] = {
    signpost_1 = "立札",
    map = "11番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [3075] = {
    signpost_3 = "立札",
    signpost_8 = "隠しアイテムｗ",
    object_3 = "ワンリキー",
    signpost_4 = "立札",
    signpost_5 = "立札",
    signpost_6 = "張り紙",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "クチバシティ",
    signpost_2 = "立札"
  },
  [3076] = {
    map = "釣りの話の聞ける家"
  },
  [3077] = {
    map = "ポケモンセンター"
  },
  [3078] = {
    map = "ポケモンセンター 2階"
  },
  [3079] = {
    map = "ポケモンファンクラブ"
  },
  [3080] = {
    map = "クチバ リニアの話をする家"
  },
  [3081] = {
    map = "フレンドリーショップ"
  },
  [3082] = {
    map = "クチバ ディグダの穴の話をする家"
  },
  [3083] = {
    map = "クチバジム"
  },
  [3084] = {
    map = "6番道路 ヤマブキ Gate"
  },
  [3085] = {
    map = "6番道路 地下通路"
  },
  [3329] = {
    signpost_1 = "立札",
    map = "1番道路"
  },
  [3330] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_1 = "立札",
    map = "マサラタウン",
    signpost_2 = "立札"
  },
  [3331] = {
    map = "レッドの家 1階"
  },
  [3332] = {
    signpost_1 = "ニンテンドウ64",
    map = "レッドの家 2階",
    signpost_2 = "椅子"
  },
  [3333] = {
    map = "グリーンの家"
  },
  [3334] = {
    map = "オーキド研究所"
  },
  [3585] = {
    signpost_1 = "立札",
    map = "3番道路"
  },
  [3586] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_6 = "張り紙",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "ニビシティ",
    signpost_2 = "立札"
  },
  [3587] = {
    map = "ニドランの話をする家"
  },
  [3588] = {
    map = "ニビジム"
  },
  [3589] = {
    map = "フレンドリーショップ"
  },
  [3590] = {
    map = "ポケモンセンター"
  },
  [3591] = {
    map = "ポケモンセンター 2F"
  },
  [3592] = {
    map = "ニビ Snooze Speech House"
  },
  [3841] = {
    signpost_1 = "隠しアイテムｗ",
    map = "アサギ港"
  },
  [3842] = {
    map = "クチバ港"
  },
  [3843] = {
    map = "1F"
  },
  [3844] = {
    signpost_3 = "ゴミ箱",
    signpost_1 = "ゴミ箱",
    map = "北北西, 北北東, 北東",
    signpost_2 = "ゴミ箱"
  },
  [3845] = {
    signpost_3 = "ゴミ箱",
    signpost_1 = "ベッド",
    map = "南西, 南南西, 北西",
    signpost_2 = "ベッド"
  },
  [3846] = {
    signpost_1 = "椅子",
    map = "南東, 南南東, 船長室"
  },
  [3847] = {
    signpost_1 = "ゴミ箱",
    map = "地下1階"
  },
  [3848] = {
    map = "アサギ Port Passage"
  },
  [3849] = {
    map = "クチバ Port Passage"
  },
  [3850] = {
    signpost_1 = "隠しアイテムｗ",
    map = "お月見山 広場",
    signpost_2 = "立札"
  },
  [3851] = {
    map = "お月見山 ギフトショップ"
  },
  [3852] = {
    object_1 = "鳳凰",
    map = "鈴の塔 屋上"
  },
  [4097] = {
    signpost_1 = "立札",
    map = "23番道路"
  },
  [4098] = {
    map = "ポケモンリーグ本部"
  },
  [4099] = {
    map = "四天王 第１の間"
  },
  [4100] = {
    map = "四天王 第２の間"
  },
  [4101] = {
    map = "四天王 第３の間"
  },
  [4102] = {
    map = "四天王 第４の間"
  },
  [4103] = {
    map = "ワタルの部屋"
  },
  [4104] = {
    map = "四天王 チャンピオンの間"
  },
  [4353] = {
    signpost_3 = "立札",
    signpost_1 = "隠しアイテムｗ",
    map = "13番道路",
    signpost_2 = "立札"
  },
  [4354] = {
    map = "14番道路"
  },
  [4355] = {
    signpost_1 = "立札",
    map = "15番道路"
  },
  [4356] = {
    signpost_1 = "立札",
    map = "18番道路"
  },
  [4357] = {
    signpost_3 = "立札",
    signpost_8 = "張り紙",
    signpost_4 = "立札",
    signpost_5 = "立札",
    signpost_6 = "立札",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "セキチクシティ",
    signpost_2 = "立札"
  },
  [4358] = {
    map = "フレンドリーショップ"
  },
  [4359] = {
    map = "サファリゾーン メインオフィス"
  },
  [4360] = {
    object_3 = "アンズ",
    object_4 = "アンズ",
    object_5 = "アンズ",
    signpost_1 = "掲示板",
    object_2 = "アンズ",
    map = "セキチクジム",
    signpost_2 = "掲示板"
  },
  [4361] = {
    map = "マサキのおじいさんの話の聞ける家"
  },
  [4362] = {
    map = "ポケモンセンター"
  },
  [4363] = {
    map = "ポケモンセンター 2階"
  },
  [4364] = {
    map = "サファリゾーン 園長の家"
  },
  [4365] = {
    map = "15番道路 セキチク Gate"
  },
  [4609] = {
    signpost_1 = "立札",
    map = "8番道路",
    signpost_2 = "鍵のかかった扉"
  },
  [4610] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "12番道路",
    signpost_2 = "立札"
  },
  [4611] = {
    signpost_1 = "立札",
    map = "10番道路 南"
  },
  [4612] = {
    warp_7 = "ラジオ塔",
    signpost_3 = "立札",
    warp_3 = "民家",
    signpost_4 = "立札",
    signpost_5 = "張り紙",
    signpost_6 = "張り紙",
    signpost_1 = "立札",
    map = "シオンタウン",
    signpost_2 = "立札"
  },
  [4613] = {
    map = "ポケモンセンター"
  },
  [4614] = {
    map = "ポケモンセンター 2階"
  },
  [4615] = {
    map = "フジ老人の家"
  },
  [4616] = {
    signpost_1 = "本棚",
    map = "シオン Speech House",
    signpost_2 = "本棚"
  },
  [4617] = {
    map = "姓名判断師の家"
  },
  [4618] = {
    map = "フレンドリーショップ"
  },
  [4619] = {
    map = "魂の家"
  },
  [4620] = {
    signpost_1 = "掲示板",
    map = "シオン ラジオ塔 1階",
    signpost_2 = "ポスター"
  },
  [4621] = {
    map = "8番道路 ヤマブキ Gate"
  },
  [4622] = {
    map = "12番道路 釣りおやじの家"
  },
  [4865] = {
    signpost_1 = "立札",
    map = "28番道路",
    signpost_2 = "隠しアイテムｗ"
  },
  [4866] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_1 = "張り紙",
    map = "しろがね山 外角",
    signpost_2 = "立札"
  },
  [4867] = {
    map = "ポケモンセンター"
  },
  [4868] = {
    map = "28番道路 売れっ子アイドルの家"
  },
  [5121] = {
    signpost_1 = "電子掲示板",
    map = "ポケモンセンター 2階"
  },
  [5122] = {
    map = "トレードセンター"
  },
  [5123] = {
    map = "コロシアム"
  },
  [5124] = {
    map = "タイムカプセル"
  },
  [5125] = {
    map = "通信交換ルーム"
  },
  [5126] = {
    map = "通信対戦ルーム"
  },
  [5377] = {
    signpost_1 = "立札",
    map = "7番道路",
    signpost_2 = "鍵のかかった扉"
  },
  [5378] = {
    signpost_1 = "掲示板",
    map = "16番道路",
    warp_1 = "民家"
  },
  [5379] = {
    signpost_1 = "立札",
    map = "17番道路",
    signpost_2 = "立札"
  },
  [5380] = {
    signpost_3 = "張り紙",
    warp_3 = "タマムシマンション(裏)",
    signpost_8 = "隠しアイテムｗ",
    signpost_4 = "張り紙",
    warp_4 = "タマムシマンション(裏)",
    signpost_5 = "張り紙",
    signpost_6 = "立札",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    object_2 = "ニョロボン",
    map = "タマムシシティ",
    signpost_2 = "立札"
  },
  [5381] = {
    signpost_1 = "掲示板",
    map = "タマムシデパート 1階",
    signpost_2 = "押しボタン(意味なし)"
  },
  [5382] = {
    map = "2階 トレーナーズショップ"
  },
  [5383] = {
    map = "3階 わざマシンショップ"
  },
  [5384] = {
    map = "4階 ワイズマンギフト"
  },
  [5385] = {
    map = "5階 ドラッグストア"
  },
  [5386] = {
    signpost_3 = "自動販売機",
    signpost_4 = "自動販売機",
    signpost_5 = "自動販売機",
    signpost_6 = "自動販売機",
    signpost_1 = "ポスター",
    map = "屋上 憩いの広場",
    signpost_2 = "押しボタン(意味なし)"
  },
  [5387] = {
    map = "タマムシデパート Elevator"
  },
  [5388] = {
    signpost_3 = "お仏壇",
    object_3 = "ピッピ",
    warp_4 = "タマムシマンション裏  2階",
    object_4 = "ニドラン雌",
    signpost_1 = "掲示板",
    object_2 = "猫",
    map = "タマムシマンション 1階",
    signpost_2 = "本棚"
  },
  [5389] = {
    signpost_3 = "本棚",
    signpost_1 = "誰かのパソコンｗ",
    map = "タマムシマンション 2階",
    warp_2 = "タマムシマンション裏 3階",
    warp_1 = "タマムシマンション裏 1階",
    signpost_2 = "掲示板"
  },
  [5390] = {
    signpost_3 = "PC",
    signpost_4 = "本棚",
    signpost_1 = "掲示板",
    map = "タマムシマンション 3階",
    warp_2 = "タマムシマンション裏 2階",
    warp_1 = "タマムシマンション裏 屋上",
    signpost_2 = "絵"
  },
  [5391] = {
    signpost_1 = "落書き",
    map = "タマムシマンション 屋上",
    warp_1 = "タマムシマンション(裏) 3階"
  },
  [5392] = {
    map = "タマムシマンション 屋上の家"
  },
  [5393] = {
    map = "ポケモンセンター"
  },
  [5394] = {
    map = "ポケモンセンター 2階"
  },
  [5395] = {
    signpost_32 = "スロットマシン",
    signpost_21 = "スロットマシン",
    signpost_10 = "カードめくり",
    signpost_3 = "カードめくり",
    signpost_38 = "ポスター",
    signpost_27 = "スロットマシン",
    signpost_16 = "スロットマシン",
    signpost_8 = "カードめくり",
    signpost_33 = "スロットマシン",
    signpost_22 = "スロットマシン",
    signpost_11 = "カードめくり",
    signpost_4 = "カードめくり",
    signpost_28 = "スロットマシン",
    signpost_17 = "スロットマシン",
    signpost_9 = "カードめくり",
    signpost_34 = "スロットマシン",
    signpost_23 = "スロットマシン",
    signpost_12 = "カードめくり",
    signpost_5 = "カードめくり",
    signpost_29 = "スロットマシン",
    signpost_18 = "スロットマシン",
    signpost_35 = "スロットマシン",
    signpost_24 = "スロットマシン",
    signpost_6 = "カードめくり",
    signpost_30 = "スロットマシン",
    signpost_19 = "スロットマシン",
    signpost_36 = "スロットマシン",
    signpost_25 = "スロットマシン",
    signpost_14 = "スロットマシン",
    signpost_7 = "カードめくり",
    signpost_1 = "カードめくり",
    map = "ゲームコーナー",
    signpost_31 = "スロットマシン",
    signpost_20 = "スロットマシン",
    signpost_37 = "ポスター",
    signpost_26 = "スロットマシン",
    signpost_15 = "スロットマシン",
    signpost_2 = "カードめくり"
  },
  [5396] = {
    map = "景品交換所"
  },
  [5397] = {
    map = "タマムシジム"
  },
  [5398] = {
    map = "タマムシ食堂"
  },
  [5399] = {
    map = "16番道路 セキチク Speech House"
  },
  [5400] = {
    map = "16番道路 Gate"
  },
  [5401] = {
    map = "7番道路 ヤマブキ Gate"
  },
  [5402] = {
    map = "17番道路 18 Gate"
  },
  [5633] = {
    connection_east = "隠しアイテムｗ",
    object_1 = "海パン野郎",
    signpost_1 = "立札",
    object_2 = "海パン野郎",
    map = "40番水道",
    signpost_2 = "隠しアイテムｗ"
  },
  [5634] = {
    warp_3 = "渦巻島 南西",
    object_3 = "海パン野郎",
    warp_4 = "渦巻島 南東",
    object_4 = "海パン野郎",
    object_5 = "海パン野郎",
    object_1 = "海パン野郎",
    signpost_1 = "隠しアイテムｗ",
    object_2 = "海パン野郎",
    map = "41番水道",
    warp_1 = "渦巻島 北西"
  },
  [5635] = {
    signpost_3 = "張り紙",
    signpost_8 = "隠しアイテムｗ",
    signpost_4 = "立札",
    signpost_5 = "立札",
    signpost_6 = "立札",
    signpost_7 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "タンバシティ",
    signpost_2 = "立札"
  },
  [5636] = {
    map = "ツボツボマニアの家"
  },
  [5637] = {
    map = "タンバジム"
  },
  [5638] = {
    map = "ポケモンセンター"
  },
  [5639] = {
    map = "薬屋"
  },
  [5640] = {
    map = "写真屋"
  },
  [5641] = {
    map = "ルギアの話を聞ける家"
  },
  [5642] = {
    map = "お見通しおじさんの家"
  },
  [5643] = {
    map = "バトルタワー 1階"
  },
  [5644] = {
    map = "バトルタワー Battle Room"
  },
  [5645] = {
    map = "バトルタワー Elevator"
  },
  [5646] = {
    map = "バトルタワー Hallway"
  },
  [5647] = {
    map = "40番道路 バトルタワー Gate"
  },
  [5648] = {
    map = "バトルタワー 外角"
  },
  [5889] = {
    signpost_3 = "隠しアイテムｗ",
    signpost_4 = "隠しアイテムｗ",
    signpost_5 = "隠しアイテムｗ",
    signpost_6 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "2番道路",
    signpost_2 = "立札"
  },
  [5890] = {
    signpost_1 = "立札",
    map = "22番道路"
  },
  [5891] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_5 = "張り紙",
    signpost_6 = "張り紙",
    signpost_1 = "立札",
    map = "トキワシティ",
    signpost_2 = "立札"
  },
  [5892] = {
    map = "トキワジム"
  },
  [5893] = {
    map = "ニックネームの話を聞ける家"
  },
  [5894] = {
    signpost_3 = "ノート",
    signpost_1 = "張り紙",
    map = "トレーナーハウス",
    signpost_2 = "張り紙"
  },
  [5895] = {
    object_2 = "トレーナー",
    map = "練習場"
  },
  [5896] = {
    map = "フレンドリーショップ"
  },
  [5897] = {
    map = "ポケモンセンター"
  },
  [5898] = {
    map = "ポケモンセンター 2階"
  },
  [5899] = {
    object_1 = "有名なあのおじさん",
    map = "有名なあのおじさんの家"
  },
  [5900] = {
    map = "2番道路 Gate"
  },
  [5901] = {
    map = "チャンピオンロード Gate"
  },
  [6145] = {
    signpost_1 = "立札",
    map = "26番道路"
  },
  [6146] = {
    signpost_1 = "立札",
    map = "27番道路"
  },
  [6147] = {
    signpost_1 = "立札",
    map = "29番道路",
    signpost_2 = "立札"
  },
  [6148] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_1 = "立札",
    map = "ワカバタウン",
    signpost_2 = "立札"
  },
  [6149] = {
    map = "ウツギ研究所"
  },
  [6150] = {
    map = "自宅 1階"
  },
  [6151] = {
    map = "自宅 2階"
  },
  [6152] = {
    map = "隣人の家"
  },
  [6153] = {
    map = "ウツギ博士の家"
  },
  [6154] = {
    map = "回復の家"
  },
  [6155] = {
    map = "26番道路 Day of Week Siblings House"
  },
  [6156] = {
    map = "27番道路 砂嵐の家"
  },
  [6157] = {
    map = "29番道路 46 Gate"
  },
  [6401] = {
    warp_4 = "清めのお札の家",
    signpost_1 = "立札",
    map = "5番道路",
    signpost_2 = "怪しい張り紙"
  },
  [6402] = {
    warp_7 = "シルフカンパニー",
    signpost_3 = "立札",
    signpost_8 = "張り紙",
    signpost_4 = "立札",
    signpost_5 = "立札",
    signpost_6 = "立札",
    signpost_7 = "張り紙",
    signpost_1 = "立札",
    map = "ヤマブキシティ",
    signpost_2 = "立札"
  },
  [6403] = {
    signpost_1 = "掛け軸",
    map = "格闘道場",
    signpost_2 = "掛け軸"
  },
  [6404] = {
    warp_23 = "北",
    warp_12 = "西",
    warp_7 = "北",
    warp_29 = "北",
    warp_18 = "南",
    warp_3 = "南東",
    warp_24 = "南西",
    warp_13 = "北",
    warp_8 = "南西",
    warp_30 = "東",
    warp_19 = "南東",
    warp_4 = "東",
    warp_25 = "北東",
    warp_14 = "東",
    warp_9 = "北東",
    warp_31 = "北東",
    warp_20 = "東",
    warp_26 = "南西",
    warp_15 = "北東",
    warp_10 = "南東",
    warp_32 = "北西",
    warp_21 = "西",
    warp_5 = "西",
    warp_27 = "南西",
    warp_16 = "北西",
    signpost_1 = "掲示板",
    map = "ヤマブキジム",
    warp_22 = "北西",
    warp_11 = "南西",
    warp_6 = "北西",
    warp_28 = "西",
    warp_17 = "中央"
  },
  [6405] = {
    map = "フレンドリーショップ"
  },
  [6406] = {
    map = "ポケモンセンター"
  },
  [6407] = {
    map = "ポケモンセンター 2階"
  },
  [6408] = {
    map = "エスパーおやじの家"
  },
  [6409] = {
    map = "ヤマブキ駅"
  },
  [6410] = {
    map = "シルフカンパニー 1階"
  },
  [6411] = {
    map = "ものまね娘の家 1階"
  },
  [6412] = {
    map = "物真似娘の家 2階"
  },
  [6413] = {
    map = "5番道路 地下通路"
  },
  [6414] = {
    map = "5番道路 ヤマブキシティ Gate"
  },
  [6415] = {
    map = "5番道路 Cleanse Tag Speech House"
  },
  [6657] = {
    signpost_3 = "立札",
    signpost_4 = "立札",
    signpost_5 = "隠しアイテムｗ",
    signpost_1 = "立札",
    map = "30番道路",
    signpost_2 = "立札"
  },
  [6658] = {
    signpost_1 = "立札",
    map = "31番道路",
    signpost_2 = "立札"
  },
  [6659] = {
    signpost_3 = "張り紙",
    signpost_4 = "張り紙",
    signpost_1 = "立札",
    map = "ヨシノシティ",
    signpost_2 = "張り紙"
  },
  [6660] = {
    map = "フレンドリーショップ"
  },
  [6661] = {
    map = "ポケモンセンター"
  },
  [6662] = {
    map = "ジムの話をする民家"
  },
  [6663] = {
    signpost_1 = "本棚",
    map = "ガイドおじさんの家",
    signpost_2 = "本棚"
  },
  [6664] = {
    map = "進化の話をする民家"
  },
  [6665] = {
    map = "30番道路 木の実の話をする家"
  },
  [6666] = {
    map = "ポケモンじいさんの家"
  },
  [6667] = {
    map = "31番道路 キキョウ Gate"
  }
}
